IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 99.
01 FIZZBUZZ-RESULT PIC X(8).

PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
        IF FUNCTION MOD(I, 15) = 0
            MOVE "FizzBuzz" TO FIZZBUZZ-RESULT
        ELSE IF FUNCTION MOD(I, 3) = 0
            MOVE "Fizz" TO FIZZBUZZ-RESULT
        ELSE IF FUNCTION MOD(I, 5) = 0
            MOVE "Buzz" TO FIZZBUZZ-RESULT
        ELSE
            MOVE I TO FIZZBUZZ-RESULT
        END-IF
        DISPLAY FIZZBUZZ-RESULT
    END-PERFORM
    STOP RUN.
